Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeSurfaceError Property
 Can't construct surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeSurfaceError { get; }
Public Shared ReadOnly Property CannotMakeSurfaceError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeSurfaceError {
	FailureDefinitionId^ get ();
}
static member CannotMakeSurfaceError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace